#+STARTUP: overview
#+TITLE: Emacs Configuration
#+AUTHOR: Vinodh MJ Human
#+EMAIL: 
#+OPTIONS: toc:nil num:nil

* Pre-requisites
#+BEGIN_SRC emacs-lisp
   ;; INSTALL PACKAGES

   ;; use-package
   (unless (package-installed-p 'use-package)
     (package-install 'use-package))

   (setq use-package-verbose t)
   (setq use-package-always-ensure t)

   (set-default-coding-systems 'utf-8)
   (prefer-coding-system 'utf-8)

   ;; set browser to firefox
   (setq browse-url-browser-function 'browse-url-firefox)

  ; HRS: Disable deprecation warnings about cl. The cl library has been deprecated, but lots of packages still use it. I can’t control that, but I can disable the warnings.
   (setq byte-compile-warnings '(cl-functions))

  (setq-default tab-width 2)

#+END_SRC

#+RESULTS:
: 2

** Themes and modeline:
#+BEGIN_SRC emacs-lisp
  (add-to-list 'default-frame-alist '(font . "DejaVu Sans Mono 13"))

    ;;(set-frame-font "Inconsolata Medium 14" nil t)
    ;;(add-to-list 'default-frame-alist '(font . "Inconsolata Medium 14"))

#+END_SRC

#+RESULTS:
: ((font . DejaVu Sans Mono 11) (font . DejaVu Sans Mono 13) (fullscreen . fullboth) (vertical-scroll-bars))
** org custom variables
#+BEGIN_SRC emacs-lisp
  (custom-set-variables
   '(org-directory "~/Dropbox/orgfiles")
   '(org-default-notes-file (concat org-directory "/notes.org"))
   '(org-export-html-postamble nil)
   '(org-hide-leading-stars t)
   '(org-startup-folded (quote overview))
   '(org-startup-indented t)
   )

  (setq org-file-apps
        (append '(
                  ("\\.pdf\\'" . "evince %s")
                  )))

#+END_SRC

#+RESULTS:
: ((\.pdf\' . evince %s))

** org agenda
#+BEGIN_SRC emacs-lisp

  ;;scheduling 
  (global-set-key "\C-ca" 'org-agenda)

  (setq org-agenda-custom-commands
        '(("c" "Simple agenda view"
           ((agenda "")
            (alltodo "")))))

  (setq org-agenda-files (list "~/Dropbox/orgfiles/i.org"
                               "~/Dropbox/orgfiles/arts.org"
                               "~/Dropbox/orgfiles/books.org"
                               "~/Dropbox/orgfiles/inbox.org"))

#+END_SRC

#+RESULTS:
| ~/Dropbox/orgfiles/i.org | ~/Dropbox/orgfiles/arts.org | ~/Dropbox/orgfiles/books.org | ~/Dropbox/orgfiles/inbox.org |

** org capture
#+BEGIN_SRC emacs-lisp

  (global-set-key (kbd "C-c c") 'org-capture)

  (setq org-capture-templates
        '(("a" "Appointment" entry (file  "~/Dropbox/orgfiles/gcal.org" )
           "* %?\n\n%^T\n\n:PROPERTIES:\n\n:END:\n\n")
          ("l" "Link" entry (file+headline "~/Dropbox/orgfiles/links.org" "Links")
           "* %? %^L" :prepend t)
          ("b" "Blog idea" entry (file+headline "~/Dropbox/orgfiles/arts.org" "Blog Topics:")
           "* %?\n" :prepend t)
          ("y" "Youtube idea" entry (file+headline "~/Dropbox/orgfiles/arts.org" "Youtube Topics:")
           "* %?\n" :prepend t)
          ("t" "To Do Item" entry (file+headline "~/Dropbox/orgfiles/i.org" "To Do")
           "* TODO %? \n%u" :prepend t)
          ("d" "Detailed To Do Item" entry (file+headline "~/Dropbox/orgfiles/i.org" "To Do")
           "* TODO %^C %? %^g\n%u" :prepend t)
          ("n" "Note" entry (file+headline "~/Dropbox/orgfiles/notes.org" "Notes")
           "* %?\n%u" :prepend t)
          ("w" "Word" entry (file+headline "~/Dropbox/orgfiles/books.org" "Words")
           "* %?\n" :prepend t)
          ("p" "Phrase" entry (file+headline "~/Dropbox/orgfiles/books.org" "Phrases")
           "* %?\n" :prepend t)
          ("e" "EPSE" entry (file+headline "~/Dropbox/orgfiles/epse.org" "Unsorted Notes")
           "* %?\n%u" :prepend t)
          ("j" "Journal entry" entry (function org-journal-find-location)
           "* %(format-time-string org-journal-time-format)%^{Title}\n%i%?")
        ))
#+END_SRC

#+RESULTS:
| a | Appointment | entry | (file ~/Dropbox/orgfiles/gcal.org) | * %? |




** Additional configuration
#+BEGIN_SRC
(setq counsel-find-file-ignore-regexp
        (concat
         ;; File names beginning with # or .
;;         "\\(?:\\`[#.]\\)"
         ;; File names ending with # or ~
         "\\|\\(?:\\`.+?[#~]\\'\\)"))
#+END_SRC

#+RESULTS:
: \|\(?:\`.+?[#~]\'\)

** Flycheck
#+BEGIN_SRC emacs-lisp
  (use-package flycheck
    :ensure t
    :init
    (global-flycheck-mode t))

  (add-hook 'c++-mode-hook (lambda () (setq flycheck-gcc-language-standard "c++11")))
  (add-hook 'c++-mode-hook (lambda () (setq flycheck-clang-language-standard "c++11")))
                                          ;(add-hook 'text-mode-hook 'flyspell-mode)
                                          ;(add-hook 'prog-mode-hook 'flyspell-prog-mode)
#+END_SRC

#+RESULTS:
| (lambda nil (setq flycheck-clang-language-standard c++11)) | (lambda nil (setq flycheck-gcc-language-standard c++11)) | irony-mode | er/add-cc-mode-expansions | (lambda nil (sb-rtags--menu-adds C++)) | (lambda nil (easy-menu-add-item nil (quote (C++)) (rtags-submenu-list))) |

** LaTeX
#+begin_src emacs-lisp
(defun org-export-as-pdf-and-open ()
  (interactive)
  (save-buffer)
  (org-open-file (org-latex-export-to-pdf)))

(add-hook 
 'org-mode-hook
 (lambda()
   (define-key org-mode-map 
       (kbd "<f5>") 'org-export-as-pdf-and-open)))
#+end_src

#+RESULTS:
| (lambda nil (define-key org-mode-map (kbd <f5>) 'org-export-as-pdf-and-open)) | flycheck-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | er/add-org-mode-expansions | turn-on-auto-fill | (lambda nil (setq fill-column 80)) | flyspell-mode | (lambda nil (org-bullets-mode 1)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-ac/setup-current-buffer |

#+BEGIN_SRC emacs-lisp
; table caption
;; (setq org-latex-caption-above 'table)
#+END_SRC

#+RESULTS:
: table

#+BEGIN_SRC emacs-lisp
    (use-package org-ref)
    (use-package bibtex-completion)
    (use-package ivy-bibtex)
    (require 'ox-latex)

    ;; (setq bibtex-completion-bibliography '("~/Dropbox/emacs/bibliography/references.bib")
    ;;       bibtex-completion-library-path '("~/Dropbox/emacs/bibliography/bibtex-pdfs/")
    ;;       bibtex-completion-notes-path "~/Dropbox/emacs/bibliography/notes/"
    ;;       bibtex-completion-notes-template-multiple-files "* ${author-or-editor}, ${title}, ${journal}, (${year}) :${=type=}: \n\nSee [[cite:&${=key=}]]\n"

    ;;       bibtex-completion-additional-search-fields '(keywords)
    ;;       bibtex-completion-display-formats
    ;;       '((article       . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${journal:40}")
    ;;         (inbook        . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} Chapter ${chapter:32}")
    ;;         (incollection  . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
    ;;         (inproceedings . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
    ;;         (t             . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}"))
    ;;       bibtex-completion-pdf-open-function
    ;;       (lambda (fpath)
    ;;         (call-process "open" nil 0 nil fpath)))


    ;; (require 'bibtex)			

    ;; (setq bibtex-autokey-year-length 4
    ;;         bibtex-autokey-name-year-separator "-"
    ;;         bibtex-autokey-year-title-separator "-"
    ;;         bibtex-autokey-titleword-separator "-"
    ;;         bibtex-autokey-titlewords 2
    ;;         bibtex-autokey-titlewords-stretch 1
    ;;         bibtex-autokey-titleword-length 5
    ;;         org-ref-bibtex-hydra-key-binding (kbd "H-b"))

    ;; (define-key bibtex-mode-map (kbd "H-b") 'org-ref-bibtex-hydra/body)

    ;; (require 'org-ref-ivy)

    ;; (setq org-ref-insert-link-function 'org-ref-insert-link-hydra/body
    ;;       org-ref-insert-cite-function 'org-ref-cite-insert-ivy
    ;;       org-ref-insert-label-function 'org-ref-insert-label-link
    ;;       org-ref-insert-ref-function 'org-ref-insert-ref-link
    ;;       org-ref-cite-onclick-function (lambda (_) (org-ref-citation-hydra/body)))

                                            ;    (setq org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdf %f"))
    (setq org-latex-pdf-process (list "latexmk -pdflatex='lualatex -shell-escape -interaction nonstopmode' -pdf -f  %f"))
                                            ;  (setq org-pandoc-options-for-beamer-pdf '((pdf-engine . "xelatex"))) ;
                                            ;  (setq org-pandoc-options-for-latex-pdf '((pdf-engine . "pdflatex"))) ;


  (with-eval-after-load 'ox-latex
        (add-to-list 'org-latex-classes
        '("uom-thesis"
           "\\documentclass{uom_eee_dissertation_casson}
           [NO-DEFAULT-PACKAGES]
           [PACKAGES]
           [EXTRA]"
           ("\\section{%s}" . "\\section*{%s}")
           ("\\subsection{%s}" . "\\subsection*{%s}")
           ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
           ("\\paragraph{%s}" . "\\paragraph*{%s}")
           ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))

  ;  (eval-after-load 'ox-latex (add-to-list 'org-export-latex-classes 'uom-thesis')) 

#+END_SRC

#+RESULTS:
| uom-thesis | \documentclass{uom_eee_dissertation_casson} |

#+begin_src elisp
(defun my-org-latex-yas ()
  "Activate org and LaTeX yas expansion in org-mode buffers."
  (yas-minor-mode)
  (yas-activate-extra-mode 'latex-mode))

(add-hook 'org-mode-hook #'my-org-latex-yas)  
#+end_src

#+RESULTS:
| my-org-latex-yas | flycheck-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | er/add-org-mode-expansions | turn-on-auto-fill | (lambda nil (setq fill-column 80)) | flyspell-mode | (lambda nil (org-bullets-mode 1)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-eldoc-load | org-ac/setup-current-buffer |

*** irony
#+BEGIN_SRC 
    ;; == irony-mode ==

    (use-package company-c-headers)
    (use-package company
      :ensure t
      :defer t
      :init (add-hook 'after-init-hook 'global-company-mode)
      :config
      (setq company-idle-delay              nil
            company-minimum-prefix-length   2
            company-show-numbers            t
            company-tooltip-limit           20
            company-dabbrev-downcase        nil))


    (use-package irony
      :ensure t)

  (add-hook 'c++-mode-hook 'irony-mode)
  (add-hook 'c-mode-hook 'irony-mode)
  (add-hook 'objc-mode-hook 'irony-mode)

  (use-package company-irony :ensure t :defer t)
  (use-package flycheck-irony :ensure t :defer t)

  (defun my-irony-mode-hook ()
    (define-key irony-mode-map
        [remap completion-at-point] 'counsel-irony)
    (define-key irony-mode-map
        [remap complete-symbol] 'counsel-irony))
  (add-hook 'irony-mode-hook 'my-irony-mode-hook)
  (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options)

#+END_SRC

#+RESULTS:
| my-irony-mode-hook | irony-cdb-autosetup-compile-options |

*** rtags
#+BEGIN_SRC

(use-package ivy-rtags)
(use-package flycheck-rtags)

(setq rtags-display-result-backend 'ivy)

(define-key c-mode-base-map (kbd "M-.") (function rtags-find-symbol-at-point))
(define-key c-mode-base-map (kbd "M-,") (function rtags-find-references-at-point))
(define-key c-mode-base-map (kbd "M-:") (function rtags-find-file))
(define-key c-mode-base-map (kbd "C-.") (function rtags-find-symbol))
(define-key c-mode-base-map (kbd "C-,") (function rtags-find-references))
;(define-key c-mode-base-map (kbd "C-<") (function rtags-find-virtuals-at-point))
(define-key c-mode-base-map (kbd "M-i") (function rtags-imenu))

(setq rtags-autostart-diagnostics t)
(defun my-flycheck-rtags-setup ()
  (flycheck-select-checker 'rtags)
  (setq-local flycheck-highlighting-mode nil) ;; RTags creates more accurate overlays.
  (setq-local flycheck-check-syntax-automatically nil))
(add-hook 'c-mode-hook #'my-flycheck-rtags-setup)
(add-hook 'c++-mode-hook #'my-flycheck-rtags-setup)
(add-hook 'objc-mode-hook #'my-flycheck-rtags-setup)

#+END_SRC

#+RESULTS:
| my-flycheck-rtags-setup | er/add-cc-mode-expansions | (lambda nil (sb-rtags--menu-adds ObjC)) | (lambda nil (easy-menu-add-item nil (quote (ObjC)) (rtags-submenu-list))) |

*** pylint
#+BEGIN_SRC emacs-lisp
  (use-package pylint
    :ensure t)
    (add-hook 'after-init-hook #'global-flycheck-mode)
    
#+END_SRC

#+RESULTS:
| global-flycheck-mode | synosaurus-mode | global-hungry-delete-mode | x-wm-set-size-hint | tramp-register-archive-file-name-handler | magit-maybe-define-global-key-bindings | table--make-cell-map |

* excorporate
#+BEGIN_SRC 

     (setq-default
      ;; configure email address and office 365 exchange server adddress for exchange web services
      excorporate-configuration
       (quote
        ("vjayakri@mathworks.com" . "https://outlook.office365.com/EWS/Exchange.asmx"))
       ;; integrate emacs diary entries into org agenda
       org-agenda-include-diary t
       )

  (add-hook 'diary-mark-entries-hook 'diary-mark-included-diary-files)

  (defun my/agenda-update-diary ()
    "Update exchange diary."
    (interactive)
    (exco-diary-diary-advice
     (calendar-current-date)
     (calendar-current-date)
     #'message "Diary updated"))

  (add-hook 'org-agenda-cleanup-fancy-diary-hook 'my/agenda-update-diary)
  (excorporate)
  (excorporate-diary-enable)

     ;; ;; enable the diary integration (i.e. write exchange calendar to emacs diary file -> ~/.emacs.d/diary must exist)
     ;; (excorporate-diary-enable)
     ;; (defun ab/agenda-update-diary ()
     ;;   "call excorporate to update the diary for today"
     ;;   (exco-diary-diary-advice (calendar-current-date) (calendar-current-date) #'message "diary updated")
     ;;   )

     ;; ;; update the diary every time the org agenda is refreshed
     ;; (add-hook 'org-agenda-cleanup-fancy-diary-hook 'ab/agenda-update-diary )

#+END_SRC

#+RESULTS:
: Excorporate diary support enabled.
* purpose mode
#+BEGIN_SRC 

  (use-package window-purpose
:ensure t)



(add-to-list 'purpose-user-name-purposes '("*compilation*" . comp))
(add-to-list 'purpose-user-mode-purposes '(rtags-mode . tags))
(add-to-list 'purpose-user-mode-purposes '(help-mode . help))
(add-to-list 'purpose-user-mode-purposes '(gud-mode . debug))
;;  (add-to-list 'purpose-user-mode-purposes '(c++-mode . cpp))

(add-to-list 'purpose-user-regexp-purposes '("\.cpp" . source))
(add-to-list 'purpose-user-regexp-purposes '("\.hpp" . header))

(purpose-compile-user-configuration)


#+END_SRC

#+RESULTS:
: ((.hpp . header) (.cpp . source))

* flycheck
#+BEGIN_SRC emacs-lisp
(require 'epa-file)
(epa-file-enable)

(setq flycheck-check-syntax-automatically '(mode-enabled new-line idle-change))
#+END_SRC

#+RESULTS:
| mode-enabled | save | new-line | idle-change |
* keys
#+begin_src 
(require 'epa-file)
(epa-file-enable)
#+end_src

#+RESULTS:
: ‘epa-file’ already enabled
